1 Задание
type = input("Введите вид питомца -> ")
age = input("Введите возраст питомца -> ")
name = input("Введите кличку питомца -> ")
print(f"Это {type} по кличке \"{name}\". Возраст: {age} года. ")

