2 Задание
print("Выведите все этапы развития человека по порядку.")
stage1 = input("1 этап - ")#Ответ - Dryopithecus
stage2 = input("2 этап - ")#Ответ - Austrolopithecus
stage3 = input("3 этап - ")#Ответ - Homo habilis
stage4 = input("4 этап - ")#Ответ - Homo erectus
stage5 = input("5 этап - ")#Ответ - Homo sapiens
stage6 = input("6 этап - ")#Ответ - Homo sapiens idaltu
stage7 = input("7 этап - ")#Ответ - Homo sapiens sapiens

print(stage1, stage2, stage3, stage4, stage5, stage6, stage7, sep=' => ')