#1 Задание

a, b, = map(int, input("Введите стороны прямоугольника в см через пробел -> ").split())
print("Периметр данного прямоугольника-> ", 2*(a+b) )
print("Площадь данного прямоугольника -> ", a*b)
