#2 Задание 

a, b, c, d, e = map(int, input("Введите пятизначное число через пробел-> ").split())
print((d**e*c)/(a-b))

